app/views/projects/index.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 4]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 4]]
---
 <li>
    <%= link_to project.title, project_path(project.id) %> (<%=" 残りタスク数 "%><%= project.tasks.unfinished.count  %><%=" / 全てのタスク数 "%><%= project.tasks.count  %>)