app/views/projects/show.html.erb

<ul>
  <% @project.tasks.each do | task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 4]]