app/controllers/projects_controller.rb

    def show
        @search = Project.task.search(params[:q])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 4]]

    def create
      @project = Project.new(project_params)
      if @project.save
---
INSERT INTO "projects" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "aa"], ["created_at", "2017-04-18 21:09:20.184864"], ["updated_at", "2017-04-18 21:09:20.184864"]]

    def update
      if @project.update(project_params)
---
UPDATE "projects" SET "title" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["title", "p1aa"], ["updated_at", "2017-04-19 17:04:21.997968"], ["id", 1]]