app/controllers/tasks_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "tasks" ("title", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aa"], ["project_id", 4], ["created_at", "2017-04-20 02:51:22.194087"], ["updated_at", "2017-04-20 02:51:22.194087"]]
---
  def create
    @project = Project.find(params[:project_id])
    @task = @project.tasks.create(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "tasks" SET "done" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["done", "t"], ["updated_at", "2017-04-20 03:02:57.848634"], ["id", 3]]
---
  def toggle
    render nothing: true
    @task = Task.find(params[:id])
    @task.done = !@task.done
    @task.save